
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Преподаватель = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	Если Объект.Преподаватель.Пустая() Тогда
		Предупреждение("Выберите преподавателя!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	Обучающиеся.Ссылка КАК Обучающийся,
	                       |	ДлительностьЗанятий.Ссылка КАК ДлительностьЗанятия
	                       |ПОМЕСТИТЬ ВТ_УченикиИДлительность
	                       |ИЗ
	                       |	Справочник.Обучающиеся КАК Обучающиеся,
	                       |	Справочник.ДлительностьЗанятий КАК ДлительностьЗанятий
	                       |ГДЕ
	                       |	НЕ Обучающиеся.ЭтоГруппа
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ_УченикиИДлительность.Обучающийся,
	                       |	ВТ_УченикиИДлительность.ДлительностьЗанятия,
	                       |	ЕСТЬNULL(РасценкиЗанятийСрезПоследних.Цена, 0) КАК Цена
	                       |ИЗ
	                       |	ВТ_УченикиИДлительность КАК ВТ_УченикиИДлительность
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиЗанятий.СрезПоследних(, Преподаватель = &Преподаватель) КАК РасценкиЗанятийСрезПоследних
	                       |		ПО ВТ_УченикиИДлительность.Обучающийся = РасценкиЗанятийСрезПоследних.Обучающийся
	                       |			И ВТ_УченикиИДлительность.ДлительностьЗанятия = РасценкиЗанятийСрезПоследних.ДлительностьЗанятия
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	ВТ_УченикиИДлительность.Обучающийся.Родитель,
	                       |	ВТ_УченикиИДлительность.Обучающийся.Наименование,
	                       |	ВТ_УченикиИДлительность.ДлительностьЗанятия.ЗначениеМинут");
	
	Запрос.УстановитьПараметр("Преподаватель", Объект.Преподаватель);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.РасценкиЗанятий.Загрузить(Результат);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьЦеныДляТекущегоРодителя(Команда)
//	стрЭталон = Элементы.РасценкиЗанятий.ТекущиеДанные;	
//	ЗаполнитьЦеныДляТекущегоРодителяНаСервере(стрЭталон);
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьЦеныДляТекущегоРодителяНаСервере(Эталон)
//	
//КонецПроцедуры
