
#Область ПрограммныйИнтерфейс

Функция СлучайныйФакт(Период) Экспорт
	
	СлучайныйФакт = "";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СлучайныеФакты.СлучайныйФакт КАК СлучайныйФакт
	                      |ИЗ
	                      |	РегистрСведений.СлучайныеФакты КАК СлучайныеФакты
	                      |ГДЕ
	                      |	СлучайныеФакты.Период = &Период");
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат СлучайныйФакт;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СлучайныйФакт = Выборка.СлучайныйФакт;
	
	Возврат СлучайныйФакт;
	
КонецФункции

Функция СоздатьЗапись(Период, СлучайныйФакт) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Период = Период;
	Запись.СлучайныйФакт = СлучайныйФакт;
	
	Запись.Записать();
	
КонецФункции

Функция НеобходимоСгенерироватьФакты(Дата) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СлучайныеФакты.СлучайныйФакт КАК СлучайныйФакт
	                      |ИЗ
	                      |	РегистрСведений.СлучайныеФакты КАК СлучайныеФакты
	                      |ГДЕ
	                      |	СлучайныеФакты.Период = &Дата");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти