
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Обучающийся") Тогда
		Обучающийся = Параметры.Обучающийся;
	КонецЕсли;
	АвтоматическиРассчитыватьПоДлительности = Истина;
	Преподаватель = ПараметрыСеанса.ТекущийПользователь;
	ЗаполнитьТаблицуЦен();
КонецПроцедуры

Процедура ЗаполнитьТаблицуЦен()	
	
	ТаблицаРасценок = РегистрыСведений.РасценкиЗанятий.ПолучитьРасценкиЗанятий(Преподаватель, Обучающийся);
	
	ТаблицаЦен.Загрузить(ТаблицаРасценок);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенЦенаПриИзменении(Элемент)
	
	Если НЕ АвтоматическиРассчитыватьПоДлительности Тогда Возврат; КонецЕсли;
	текСтрока = Элементы.ТаблицаЦен.ТекущиеДанные;
	
	РассчитатьСтоимостьПоДлительностиНаСервере(текСтрока.Цена, текСтрока.ДлительностьЗанятия);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостьПоДлительностиНаСервере(Цена, ДлительностьЗанятия)

	СтоимостьМинуты = Цена / ДлительностьЗанятия.ЗначениеМинут;
	
	Для Каждого СтрЦена из ТаблицаЦен Цикл
		СтрЦена.Цена = СтрЦена.ДлительностьЗанятия.ЗначениеМинут * СтоимостьМинуты;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	ПровестиИЗакрытьНаСервере();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаСервере
Процедура ПровестиИЗакрытьНаСервере()
	
	НовДок = Документы.УстановкаЦенЗанятий.СоздатьДокумент();
	НовДок.Дата = ТекущаяДата();
	НовДок.Преподаватель = Преподаватель;
	
	Для Каждого СтрЦена из ТаблицаЦен Цикл
		НовСтр = НовДок.РасценкиЗанятий.Добавить();
		НовСтр.Обучающийся = Обучающийся;
		НовСтр.ДлительностьЗанятия = СтрЦена.ДлительностьЗанятия;
		НовСтр.Цена = СтрЦена.Цена;
	КонецЦикла;
	
	НовДок.Комментарий = "Установка цен для " + Строка(Обучающийся.Ссылка) + " от " + НовДок.Дата;
	НовДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

