&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ЗаполнитьВводныеДанные();
		ЗаполнитьРасценкиЗанятий();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВводныеДанные()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИнформацияОбОбразованииСрезПоследних.УчебноеЗаведение,
	                      |	ИнформацияОбОбразованииСрезПоследних.ГодОбучения,
	                      |	ИнформацияОбОбразованииСрезПоследних.УчебноеПособие,
	                      |	ПредпочтительныйТипЗанятийСрезПоследних.ТипПроведенияЗанятий,
	                      |	УровниЗнанийОбучающихсяСрезПоследних.УровеньЗнаний
	                      |ИЗ
	                      |	Справочник.Обучающиеся КАК Обучающиеся
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УровниЗнанийОбучающихся.СрезПоследних(, Обучающийся = &Обучающийся) КАК УровниЗнанийОбучающихсяСрезПоследних
	                      |		ПО Обучающиеся.Ссылка = УровниЗнанийОбучающихсяСрезПоследних.Обучающийся
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияОбОбразовании.СрезПоследних(, Обучающийся = &Обучающийся) КАК ИнформацияОбОбразованииСрезПоследних
	                      |		ПО Обучающиеся.Ссылка = ИнформацияОбОбразованииСрезПоследних.Обучающийся
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредпочтительныйТипЗанятий.СрезПоследних(, Обучающийся = &Обучающийся) КАК ПредпочтительныйТипЗанятийСрезПоследних
	                      |		ПО Обучающиеся.Ссылка = ПредпочтительныйТипЗанятийСрезПоследних.Обучающийся
	                      |ГДЕ
	                      |	Обучающиеся.Ссылка = &Обучающийся");
	Запрос.УстановитьПараметр("Обучающийся", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ТипПроведенияЗанятий	= Результат.ТипПроведенияЗанятий;
		ГодОбучения				= Результат.ГодОбучения;
		УровеньЗнаний			= Результат.УровеньЗнаний;
		УчебноеПособие			= Результат.УчебноеПособие;
		УчебноеЗаведение		= Результат.УчебноеЗаведение;
	Конецесли;			
	
КонецПроцедуры

Процедура ЗаполнитьРасценкиЗанятий()

	ТаблицаЦен = РегистрыСведений.РасценкиЗанятий.ПолучитьРасценкиЗанятий(ПараметрыСеанса.ТекущийПользователь, Объект.Ссылка);
	
	Если ТаблицаЦен.Количество() > 0 Тогда
		Элементы.СтоимостьЗанятий.Заголовок = "";
		Для Каждого СтрЦена из ТаблицаЦен Цикл
			Элементы.СтоимостьЗанятий.Заголовок = Элементы.СтоимостьЗанятий.Заголовок + Строка(СтрЦена.Цена) + " / " + Строка(СтрЦена.ДлительностьЗанятия)+"  ";
		КонецЦикла;
	КонецЕсли;


КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьТипЗанятий();
	
	ПредыдущийТипЗанятий = РегистрыСведений.ПредпочтительныйТипЗанятий.ПолучитьТипЗаниятй(Объект.Ссылка);
	Если ПредыдущийТипЗанятий <> ТипПроведенияЗанятий Тогда
		РегистрыСведений.ПредпочтительныйТипЗанятий.ЗаписатьТипЗанятий(Объект.Ссылка, ТипПроведенияЗанятий);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьУровеньЗнаний();
	
	ПредыдущийУровеньЗнаний = РегистрыСведений.УровниЗнанийОбучающихся.ПолучитьУровеньЗнаний(Объект.Ссылка);
	Если ПредыдущийУровеньЗнаний <> УровеньЗнаний Тогда
		РегистрыСведений.УровниЗнанийОбучающихся.ЗаписатьУровеньЗнаний(Объект.Ссылка, УровеньЗнаний);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьИнформациюОбОбразовании();
	
	ПредыдущаяИнформацияОбОбразовании = РегистрыСведений.ИнформацияОбОбразовании.ПолучитьИнформациюОбОбразовании(Объект.Ссылка);
	Если ПредыдущаяИнформацияОбОбразовании = Неопределено Тогда 
		РегистрыСведений.ИнформацияОбОбразовании.ЗаписатьИнформациюОбОбразовании(Объект.Ссылка, УчебноеЗаведение, ГодОбучения, УчебноеПособие);
	ИначеЕсли ПредыдущаяИнформацияОбОбразовании.ГодОбучения			<> ГодОбучения		ИЛИ
			  ПредыдущаяИнформацияОбОбразовании.УчебноеЗаведение	<> УчебноеЗаведение	ИЛИ
			  ПредыдущаяИнформацияОбОбразовании.УчебноеПособие		<> УчебноеПособие 	Тогда
		РегистрыСведений.ИнформацияОбОбразовании.ЗаписатьИнформациюОбОбразовании(Объект.Ссылка, УчебноеЗаведение, ГодОбучения, УчебноеПособие);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПроверитьИЗаписатьТипЗанятий();
	ПроверитьИЗаписатьУровеньЗнаний();
	ПроверитьИЗаписатьИнформациюОбОбразовании()
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦены(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда Сообщить("Необходимо записать элемент справочника!"); Возврат; КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Обучающийся", Объект.Ссылка);
	
	ОткрытьФормуМодально("РегистрСведений.РасценкиЗанятий.Форма.ФормаУстановкиЦен", ПараметрыФормы, ЭтаФорма);
	
	ЗаполнитьРасценкиЗанятий();
	
КонецПроцедуры
