
// Выводит сообщение об ошибке заполнения поля.
//
Процедура СообщитьОбОшибке(ОбъектСОшибкой, ТекстСообщения, ИмяТабличнойЧасти = Неопределено, НомерСтроки = Неопределено, Поле = Неопределено, Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		Сообщение.Поле = ИмяТабличнойЧасти + "[" + (НомерСтроки - 1) + "]." + Поле;
	ИначеЕсли ЗначениеЗаполнено(Поле) Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	
	Если ОбъектСОшибкой <> Неопределено Тогда
		Сообщение.УстановитьДанные(ОбъектСОшибкой);
	КонецЕсли;
	
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры // СообщитьОбОшибке()

Функция ЕстьПарольПользователя() Экспорт
	Если ПользователиИнформационнойБазы.ТекущийПользователь().ПарольУстановлен или
		//Агенон/Troyan/08-11-19/Н1/
		ПользователиИнформационнойБазы.ПолучитьПользователей().Количество()=0 
		//Агенон/Troyan/08-11-19/К1/
	Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
