Функция ПолучитьЦенуЗанятия(Преподаватель, Длительность, Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РасценкиЗанятийСрезПоследних.Цена
	                      |ИЗ
	                      |	РегистрСведений.РасценкиЗанятий.СрезПоследних(
	                      |			,
	                      |			Преподаватель = &Преподаватель
	                      |				И ДлительностьЗанятия = &Длительность
	                      |				И Обучающийся = &Обучающийся) КАК РасценкиЗанятийСрезПоследних");
	Запрос.УстановитьПараметр("Преподаватель",	Преподаватель);
	Запрос.УстановитьПараметр("Длительность",	Длительность);
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции


Функция ПолучитьРасценкиЗанятий(Преподаватель, Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(РасценкиЗанятийСрезПоследних.Цена, 0) КАК Цена,
	                      |	ДлительностьЗанятий.Ссылка КАК ДлительностьЗанятия
	                      |ИЗ
	                      |	Справочник.ДлительностьЗанятий КАК ДлительностьЗанятий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиЗанятий.СрезПоследних(
	                      |				,
	                      |				Преподаватель = &Преподаватель
	                      |					И Обучающийся = &Обучающийся) КАК РасценкиЗанятийСрезПоследних
	                      |		ПО ДлительностьЗанятий.Ссылка = РасценкиЗанятийСрезПоследних.ДлительностьЗанятия
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РасценкиЗанятийСрезПоследних.ДлительностьЗанятия.ЗначениеМинут,
	                      |	Цена");
	Запрос.УстановитьПараметр("Преподаватель",	Преподаватель);
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции