Процедура ЗаписатьУровеньЗнаний(Обучающийся, УровеньЗнаний) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	
	Запись.Период 			= ТекущаяДата();
	Запись.Обучающийся 		= Обучающийся;
	Запись.УровеньЗнаний	= УровеньЗнаний;
	Запись.Записать();
	
КонецПроцедуры

Функция ПолучитьУровеньЗнаний(Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	УровниЗнанийОбучающихсяСрезПоследних.УровеньЗнаний
	                      |ИЗ
	                      |	РегистрСведений.УровниЗнанийОбучающихся.СрезПоследних(, ) КАК УровниЗнанийОбучающихсяСрезПоследних
	                      |ГДЕ
	                      |	УровниЗнанийОбучающихсяСрезПоследних.Обучающийся = &Обучающийся");
	
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.УровеньЗнаний;
	Иначе
		Возврат Перечисления.УровниЗнаний.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
