Функция ПолучитьИнформациюОбОбразовании(Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИнформацияОбОбразованииСрезПоследних.УчебноеЗаведение,
	                      |	ИнформацияОбОбразованииСрезПоследних.ГодОбучения,
	                      |	ИнформацияОбОбразованииСрезПоследних.УчебноеПособие
	                      |ИЗ
	                      |	РегистрСведений.ИнформацияОбОбразовании.СрезПоследних КАК ИнформацияОбОбразованииСрезПоследних
	                      |ГДЕ
	                      |	ИнформацияОбОбразованииСрезПоследних.Обучающийся = &Обучающийся");
	
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьИнформациюОбОбразовании(Обучающийся, УчебноеЗаведение, ГодОбучения, УчебноеПособие) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Обучающийся		= Обучающийся;
	Запись.Период			= ТекущаяДата();
	Запись.УчебноеЗаведение	= УчебноеЗаведение;
	Запись.ГодОбучения		= ГодОбучения;
	Запись.УчебноеПособие	= УчебноеПособие;
	Запись.Записать();

КонецПроцедуры