
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().ПарольУстановлен или
		//Агенон/Troyan/08-11-19/Н1/
		ПользователиИнформационнойБазы.ПолучитьПользователей().Количество()=0 
		//Агенон/Troyan/08-11-19/К1/
		Тогда 
		СтандартнаяОбработка = Истина;
		Отказ				 = Истина;
	КонецЕсли;
	
	ОтказЗапуска = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
		
	Если ПустаяСтрока(Пароль1) Тогда
		ПоказатьПредупреждение(, "Пароль не заполнен!");
		Возврат;
	ИначеЕсли Пароль1<>Пароль2 Тогда
		ПоказатьПредупреждение(, "Пароль отличаются!");
		Возврат;
	ИначеЕсли СтрНайти(Пароль1,"!")=0 И СтрНайти(Пароль1,"*")=0 И СтрНайти(Пароль1,"%")=0 И СтрНайти(Пароль1,"@")=0 Тогда
		ПоказатьПредупреждение(, "Нет спецсимвола!");
		Возврат;
	КонецЕсли;
	
	ОкНаСервере();
	Если НЕ ОтказЗапуска Тогда Закрыть(ОтказЗапуска); КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОкНаСервере()
	Юзер = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Юзер.Пароль = Пароль2;
	Юзер.Записать();
	
	ОтказЗапуска = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(ОтказЗапуска);
КонецПроцедуры
