
&НаКлиенте
Процедура СписокОбучающихся(Команда)
	ОткрытьФорму("Справочник.Обучающиеся.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КонсольЗапросов(Команда)
	ОткрытьФорму("Обработка.КонсольЗапросов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СписокЗанятий(Команда)
	ОткрытьФорму("Документ.Занятия.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ТемыЗанятий(Команда)
	ОткрытьФорму("Справочник.ТемыПреподователей.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ТемыПоУчебинкам(Команда)
	ОткрытьФорму("Справочник.ТемыПоУчебникам.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СписокРодителей(Команда)
	ОткрытьФорму("Справочник.РодителиОбучающихся.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Пользователи(Команда)
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦенЗанятий(Команда)
	ОткрытьФорму("Документ.УстановкаЦенЗанятий.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗанятий(Команда)
	
	СтрПараметры = Новый Структура;
	
    ПользовательскиеНастройки = УстановитьПользовательскиеНастройкиОтчета("ГрафикЗанятий", СтрПараметры);	
    
    ПараметрыФормы = Новый Структура("ПользовательскиеНастройки", ПользовательскиеНастройки);
    
    ОткрытьФорму("Отчет.ГрафикЗанятий.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВсеДокументы(Команда)
	
	СтрПараметры = Новый Структура;    
    ОткрытьФорму("Отчет.ВсеДокументы.Форма.ФормаОтчета", , ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция УстановитьПользовательскиеНастройкиОтчета(ТипОтчета,СтруктураПараметров)
	
    СтруктураНастроек = Новый Структура;
    ОтчетОбъект = Отчеты[ТипОтчета].Создать();
	
	СхемаКД = ОтчетОбъект.СхемаКомпоновкиДанных;
	
	ВариантыОтчета = СхемаКД.ВариантыНастроек;
	
	СтруктураВариантов = Новый Структура;
	
	Для Каждого стрВариант из ВариантыОтчета Цикл
		СтруктураВариантов.Вставить(стрВариант.Имя, стрВариант.Настройки);
	КонецЦикла;
	
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураВариантов.Основной);	
	//ПользовательскиеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки;
	//Для Каждого ЭлПараметр  Из СтруктураПараметров Цикл
	//    Для Каждого ПараметрСКД Из ПользовательскиеНастройки.Элементы Цикл
	//        Если ТипЗнч(ПараметрСКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда  
	//            Если строка(ПараметрСКД.Параметр) = ЭлПараметр.Ключ Тогда 
	//                ПараметрСКД.Значение = ЭлПараметр.Значение;
	//                ПараметрСКД.Использование = Истина;
	//            КонецЕсли;
	//        КонецЕсли;
	//    КонецЦикла;    
	//КонецЦикла;
	//    
	//Возврат ПользовательскиеНастройки;
	
КонецФункции

&НаКлиенте
Процедура ПанельАдминистратора(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистратора.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Продажи(Команда)
	ОткрытьФорму("Отчет.Продажи.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СписокПросроченныхЗанятий(Команда)
	ОткрытьФорму("ОбщаяФорма.ЗанятияБезПодтверждения");
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСистемы(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкаСистемы");
КонецПроцедуры
