
&НаКлиенте
Процедура СписокОбучающихся(Команда)
	ОткрытьФорму("Справочник.Обучающиеся.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КонсольЗапросов(Команда)
	ОткрытьФорму("Обработка.КонсольЗапросов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СписокЗанятий(Команда)
	ОткрытьФорму("Документ.Занятия.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ТемыЗанятий(Команда)
	ОткрытьФорму("Справочник.ТемыПреподователей.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ТемыПоУчебинкам(Команда)
	ОткрытьФорму("Справочник.ТемыПоУчебникам.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СписокРодителей(Команда)
	ОткрытьФорму("Справочник.РодителиОбучающихся.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Пользователи(Команда)
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦенЗанятий(Команда)
	ОткрытьФорму("Документ.УстановкаЦенЗанятий.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗанятий(Команда)
	ОткрытьФорму("Отчет.ГрафикЗанятий.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПанельАдминистратора(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистратора.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Продажи(Команда)
	ОткрытьФорму("Отчет.Продажи.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СписокПросроченныхЗанятий(Команда)
	ОткрытьФорму("ОбщаяФорма.ЗанятияБезПодтверждения");
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСистемы(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкаСистемы");
КонецПроцедуры
