Процедура ЗаписатьТипЗанятий(Обучающийся, ТипЗанятий) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.Обучающийся = Обучающийся;
	Запись.ТипПроведенияЗанятий	= ТипЗанятий;
	Запись.Записать();
	
КонецПроцедуры

Функция ПолучитьТипЗаниятй(Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПредпочтительныйТипЗанятийСрезПоследних.ТипПроведенияЗанятий
	                      |ИЗ
	                      |	РегистрСведений.ПредпочтительныйТипЗанятий.СрезПоследних КАК ПредпочтительныйТипЗанятийСрезПоследних
	                      |ГДЕ
	                      |	ПредпочтительныйТипЗанятийСрезПоследних.Обучающийся = &Обучающийся");
	
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ТипПроведенияЗанятий;
	Иначе
		Возврат Перечисления.ТипыПроведенияЗанятий.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

