
Процедура ОтправитьPUSH (Тема, Тело, Ошибка = Истина, Устройство=Неопределено) Экспорт
		
	//HTTPСоединение = Новый HTTPСоединение("api.pushover.net", ,,,,,Новый ЗащищенноеСоединениеOpenSSL());	
	//
	//СтруктураЗапроса = Новый Структура;
	//СтруктураЗапроса.Вставить("token", 		"agof8dem7drby3mvimmakrdxpws28x");
	//СтруктураЗапроса.Вставить("user", 		"uj2irwpewgyfiis731m8v9k2yxcxxj");
	//СтруктураЗапроса.Вставить("title", 		Тема);
	//СтруктураЗапроса.Вставить("message", 	Тело);
	//
	//Если Устройство<>Неопределено Тогда
	//	СтруктураЗапроса.Вставить("device", Устройство);
	//КонецЕсли;
	//
	//Если Ошибка Тогда
	//	СтруктураЗапроса.Вставить("sound", 		"siren");
	//Иначе
	//	СтруктураЗапроса.Вставить("sound",		"pianobar");
	//КонецЕсли;
	//
	//ЗаписьJS = Новый ЗаписьJSON();
	//ЗаписьJS.ПроверятьСтруктуру = Ложь;
	//ЗаписьJS.УстановитьСтроку();
	//ЗаписатьJSON(ЗаписьJS, СтруктураЗапроса);
	//
	//ТелоДляЗапроса = ЗаписьJS.Закрыть();
	//
	//HTTPЗапрос = Новый HTTPЗапрос("/1/messages.json");
	//HTTPЗапрос.УстановитьТелоИзСтроки(ТелоДляЗапроса);
	//HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	//
	//HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);

	
КонецПроцедуры
