
Функция ЕстьПросроченныеЗанятия() Экспорт
	
	КонецЭтогоДня = КонецДня(ТекущаяДатаСеанса()); 
	НижняяГраницаНапоминаний = Константы.НижняяГраницаНапоминанийОСтатусахЗанятий.Получить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтатусыЗанятий.Занятие
	                      |ИЗ
	                      |	РегистрСведений.СтатусыЗанятий КАК СтатусыЗанятий
	                      |ГДЕ
	                      |	СтатусыЗанятий.Занятие.Дата < &Дата
	                      |			И СтатусыЗанятий.Занятие.Дата > &НижняяГраница
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Отменено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Перенесено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Проведено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.ПроведеноИОплачено)");
	
	Запрос.УстановитьПараметр("Дата", КонецЭтогоДня - 60 * 60 * 24);
	Запрос.УстановитьПараметр("НижняяГраница", НижняяГраницаНапоминаний);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции