
Функция ЕстьПросроченныеЗанятия() Экспорт
	
	КонецЭтогоДня = КонецДня(ТекущаяДатаСеанса()); 
	НижняяГраницаНапоминаний = Константы.НижняяГраницаНапоминанийОСтатусахЗанятий.Получить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтатусыЗанятий.Занятие
	                      |ИЗ
	                      |	РегистрСведений.СтатусыЗанятий КАК СтатусыЗанятий
	                      |ГДЕ
	                      |	СтатусыЗанятий.Занятие.Дата < &Дата
	                      |			И СтатусыЗанятий.Занятие.Дата > &НижняяГраница
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Отменено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Перенесено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Проведено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.ПроведеноИОплачено)");
	
	Запрос.УстановитьПараметр("Дата", КонецЭтогоДня - 60 * 60 * 24);
	Запрос.УстановитьПараметр("НижняяГраница", НижняяГраницаНапоминаний);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура СгенерироватьСлучайныеПожелания(Пользователь, Дата) Экспорт
	
	Если НЕ РегистрыСведений.СлучайныеПожелания.НеобходимоСгенерироватьПожелания(Пользователь, Дата) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСGPT.СгенерироватьСлучайныеПожелания(Пользователь, Дата);
	
КонецПроцедуры

Процедура СгенерироватьСлучайныеФакты(Дата) Экспорт
	
	Если НЕ РегистрыСведений.СлучайныеФакты.НеобходимоСгенерироватьФакты(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСGPT.СгенерироватьСлучайныеФакты(Дата);
	
КонецПроцедуры

Функция ТекущийПользователь() Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

Функция ТекстСлучайногоПожелания(ТекущийПольщователь, НачалоДня) Экспорт
	
	Если Константы.НеВыводитьСлучайныеПожелания.Получить() Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат РегистрыСведений.СлучайныеПожелания.ИзалечьСлучайноеПожелание(НачалоДня, ТекущийПольщователь);
	
КонецФункции
