Функция ЕстьПросроченныеЗанятия() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтатусыЗанятий.Занятие
	                      |ИЗ
	                      |	РегистрСведений.СтатусыЗанятий КАК СтатусыЗанятий
	                      |ГДЕ
	                      |	СтатусыЗанятий.Занятие.Дата < &Дата
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Отменено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Перенесено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.Проведено)
	                      |	И СтатусыЗанятий.СтатусЗанятия <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятий.ПроведеноИОплачено)");
	Запрос.УстановитьПараметр("Дата", КонецДня(ТекущаяДата()-86400));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции