
Процедура ПередНачаломРаботыСистемы(Отказ)
	
	Если НЕ УчительскаяСервер.ЕстьПарольПользователя() Тогда
		ДопПараметры = Новый Структура("Отказ", Отказ);
		Оповещение = Новый ОписаниеОповещения("ОткрытиеФормыИзмененияПароля_Завершение",УчительскаяКлиент,ДопПараметры);
		//ОткрытьФорму("ОбщаяФорма.ФормаИзмененияПароля",,,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Отказ = ОткрытьФормуМодально("ОбщаяФорма.ФормаИзмененияПароля");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	Если ДополнительныйВызовСервера.ЕстьПросроченныеЗанятия() Тогда
		ОткрытьФорму("ОбщаяФорма.ЗанятияБезПодтверждения");
	КонецЕсли;
	
	НачалоДня = НачалоДня(ТекущаяДата());
	ТекущийПользователь = ДополнительныйВызовСервера.ТекущийПользователь();
	
	ДополнительныйВызовСервера.СгенерироватьСлучайныеПожелания(ТекущийПользователь, НачалоДня);
	ДополнительныйВызовСервера.СгенерироватьСлучайныеФакты(НачалоДня);
	
	ТекстПожелания = ДополнительныйВызовСервера.ТекстСлучайногоПожелания(ТекущийПользователь, НачалоДня);
	
	Если НЕ ПустаяСтрока(ТекстПожелания) Тогда
		ПоказатьПредупреждение(, ТекстПожелания);
	КонецЕсли;
	
КонецПроцедуры
