// Процедура разворачивает дерево значений на форме.
//
Процедура РазвернутьДеревоЗначенийСвойств(ЭлементФормы, Дерево) Экспорт
	
	Для каждого Элемент Из Дерево.ПолучитьЭлементы() Цикл
		Идентификатор = Элемент.ПолучитьИдентификатор();
		ЭлементФормы.Развернуть(Идентификатор, Истина);
	КонецЦикла;
	
КонецПроцедуры // РазвернутьДеревоЗначенийСвойств()


Процедура ОткрытиеФормыИзмененияПароля_Завершение(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) И Результат Тогда ДопПараметры.Отказ = Истина; ПрекратитьРаботуСистемы(); КонецЕсли;
	
	// ПодключаемоеОборудование
	//МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
КонецПроцедуры
