
Процедура ОбработкаПроведения(Отказ, Режим)
	ТаблицаУроки = Занятие.Уроки.Выгрузить();
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаУроки Из ТаблицаУроки Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период					= ТекСтрокаУроки.ДатаНачала;
		Движение.Преподаватель			= Занятие.Преподаватель;
		Движение.Дисциплина				= Занятие.Дисциплина;
		Движение.Сумма					= ТекСтрокаУроки.Сумма;
		Движение.Количество				= 1;
		Движение.Цена					= ТекСтрокаУроки.Сумма;
		Движение.Обучающийся			= ТекСтрокаУроки.Обучающийся;
		Движение.ТемаПреподователя		= Занятие.ТемаПреподователя;
		Движение.ТемаПоУчебнику			= Занятие.ТемаПоУчебнику;
		Движение.ДлительностьЗанятия	= ТекСтрокаУроки.Длительность;
	КонецЦикла;

КонецПроцедуры
