&НаКлиенте
Перем ЭлементОтбораВладелец;

&НаКлиенте
Процедура УчебникПриИзменении(Элемент)
	Если ЭлементОтбораВладелец = Неопределено Тогда		
		ЭлементОтбораВладелец = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораВладелец.ЛевоеЗначение			= Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбораВладелец.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;		
	КонецЕсли;
	
	Если Учебник.Пустая() Тогда
		ЭлементОтбораВладелец.Использование = Ложь;
	Иначе
		ЭлементОтбораВладелец.Использование = Истина;
		ЭлементОтбораВладелец.ПравоеЗначение = Учебник;
	КонецЕсли;
КонецПроцедуры
