
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	//Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	////ДокументРезультат.ПоказатьУровеньГруппировокСтрок(YYYYY); //Здесь указываем УРОВЕНЬ группировки
	//ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2);
	////
	
КонецПроцедуры
