Функция ВернутьУченикаПоЗанятию(Занятие) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РасписаниеЗанятий.Обучающийся
	                      |ИЗ
	                      |	РегистрСведений.РасписаниеЗанятий КАК РасписаниеЗанятий
	                      |ГДЕ
	                      |	РасписаниеЗанятий.Занятие = &Занятие");
	Запрос.УстановитьПараметр("Занятие", Занятие);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.Обучающиеся.ПустаяСсылка();
	Иначе
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Обучающийся;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции