Функция ПолучитьСтатусЗанятия(Занятие) Экспорт
	
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	СтатусыЗанятий.СтатусЗанятия
	                       |ИЗ
	                       |	РегистрСведений.СтатусыЗанятий КАК СтатусыЗанятий
	                       |ГДЕ
	                       |	СтатусыЗанятий.Занятие = &Занятие");
	Запрос.УстановитьПараметр("Занятие", Занятие);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.СтатусЗанятия;
	Иначе
		Возврат Перечисления.СтатусыЗанятий.НеПодтверждено;
	КонецЕсли;
	
КонецФункции

Функция НайтиСтатусЗанятия(Занятие) Экспорт

	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	КОЛИЧЕСТВО(*) КАК ЕстьЗаписи
	                       |ИЗ
	                       |	РегистрСведений.СтатусыЗанятий КАК СтатусыЗанятий
	                       |ГДЕ
	                       |	СтатусыЗанятий.Занятие = &Занятие");
	Запрос.УстановитьПараметр("Занятие", Занятие);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ЕстьЗаписи;
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьСтатусЗанятия(Занятие, СтатусЗанятия) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Занятие = Занятие;
	Запись.СтатусЗанятия = СтатусЗанятия;
	Запись.Записать();
	
КонецФункции


